[
    {
        "linkname": "General",
        "content": [
            "This text will contain all the answers to the questions in the quiz. However, I hope you have brought your reading glasses, and pay attention because the answers might not be easy to spot. In this text there will be information about a company called Wires inc, which owns the company Sparks inc, the company we will focus on in this quiz. Spark Inc or Si for short was founded in 1899 by Sir Harris John the fifth after he discovered gold during the gold rush in Klondike. After he died in 1912 his son Harry John took over and ran the company, as good, if not better than his father. His goal was to make it the most profitable company of all time. He wanted his legacy and his family name to be known for eternity across the world. The family name John would be associated with elites and kings alike! Harry was not a modest man but a big dreamer. It was then unfortunate that he gambled all the company money away in 1933 because he thought he had a royal flush, but it turned out when he cheated, he took the wrong card. After losing his money, he started all over, now penniless and homeless. Harry started by traveling to the neighboring country, the United States of America. He had heard that this was the country where dreams became alive and so he set off searching for ways to bring his company back up. His only skills were in cheating and tricking so he knew exactly what kind of work he should acquire to utilize his skills. He became a car salesman and a door-to-door seller, two jobs that were made for him. To understand the door-to-door business I have provided some important facts about the technique:",
            "\nDoor-to-door is a canvassing technique that is generally used for sales, marketing, advertising, evangelism or campaigning, in which the person or persons walk from the door of one house to the door of another, trying to sell or advertise a product or service to the general public or gather information. People who use this sales approach are often known as traveling salesmen, or by the archaic name drummer (someone who \"drums up\" business), and the technique is also sometimes called direct sales. A variant of this involves cold calling first, when another sales representative attempts to gain agreement that a salesperson should visit.",
            "\nHistorically, this was a major method of distributing goods outside large towns, with the salesmen, often self-employed known as pedlars or peddlers, also hawkers. With the huge growth of retail shops in the 19th century, it became less important, and the development of mail order and finally sales via the internet gradually reduced its significance in advanced economies except in a few fields, such as repairs and improvements to homes.\nProducts or services sold door-to-door are generally in one of seven industries: cable, telecommunications, solar, energy, security, landscaping and construction.[1] There are also many multi-level marketing products sold door-to-door.[2] The industries accounting for the largest share of direct-sales revenue include construction and telecommunications.[3] The largest subset of these would be the home improvement products/services where items sold could be new or repaired roofs, siding, new replacement windows, and decorative stone. As of 2008 the business model of many companies that participate in this type of direct marketing has changed with the growth of the Information Age. Products sold door-to-door are now more likely to be more subtle in nature: such as sheets of coupons to events or local businesses, season tickets to local professional sports teams (both of these are known in the industry as \"Cert [or certificate] Sales\", or subscriptions to home television services or broadband internet services. Telecommunications companies like Verizon Communications (FiOS), Comcast (Cable television and internet) and AT&T (U-verse) all contract with various marketing companies for nationwide sales fulfillment at the residential level. While the practice of the salesman carrying a bag of goods on his shoulder to sell to the public declined with advances made in technology and internet selling, there has been a resurgence of door-to-door selling in recent years, especially in the energy and solar industries (SolarCity) (Vivint Solar).[4][5]\nIn the United States, some communities attempted to criminalize this form of selling by passing what is known as a Green River Ordinance which bans all door-to-door sales. In 1933, the United States Court of Appeals for the 10th Circuit upheld such a law valid [6] but in 1976 the Supreme Court extended the First Amendment to commercial speech[7] and in 1980 set forth a four-pronged test regarding the regulation of door-to-door selling:[8]\nThe pitch itself must not regard things that are in themselves illegal and must be truthful to be protected by the First Amendment.[9] Assertive governmental interest is substantial. The regulation directly advances point 2. If the regulation is necessary to serve that interest (i.e. demonstrating “no solicitation” signs and already existing trespass laws are not sufficient). If a regulation meets these criteria, it is most likely legal.\nIn 2011, door-to-door sales was named one of the top 10 dead or dying career paths with an 18 percent decline in positions expected by 2018.[10] Instead, between 2012-2013 door-to-door sales positions started growing 34% year-over-year.[1] In 2017 the market is believed to be worth $36 billion, an increase of $7.7 billion since 2009 (or $4 billion if adjusted for inflation).[11][12] As of 2017, the research shows that 20.5 million people in the United States have signed agreements with direct selling companies making them eligible to purchase discounted products and resell them that at a profit, and to sponsor others individuals who also can sell the products.[12]\nNew technologies have also changed door-to-door sales' efficacy and appeal for organizations. Expansive databases of American households pull together demographic information, consumer data, and past-canvassing profiles to allow precise targeting of potential buyers. Corporations no longer knock on all the doors in an area, instead they focus on people most likely to buy their products or services.[13]\nLaw enforcement and detective work\nPolice detectives many times will go door-to-door at residences that exist nearby a crime scene, to see if the victim or perp may have known (or may have been known by) any of the residents in the general vicinity, or to gather information from potential witnesses.[14]\nThe Bible records that Jesus sent out his disciples to evangelize by visiting peoples homes in pairs of two believers (cf. Luke 10:1–12).[15]",
            "\nAs such, in Christianity, Methodist churches aligned with the holiness movement engage in door to door evangelism and in this tradition, it is frequently referred to as \"calling\".[16] Baptist congregations are known for door to door evangelism as well. In both the Holiness Methodist and Baptist Christian traditions, it is common for those visiting peoples homes to distribute to residents gospel tracts.[17]",
            "\nRestorationist groups, such as Jehovah's Witnesses, Seventh-Day Adventists and The Church of Jesus Christ of Latter-Day Saints, are known for door-to-door evangelizing and proselytizing.",
            "\nWith some hard work, he was able to gather enough money to set up his business in the United States. The business would focus on his jobs, and it became the first door-to-door car sales business in the country. He would go from door to door and convince people to buy cars. To make the business even more profitable, he bought used cars and fixed them up to charge high prices for “premium” cars. Eventually, he settled down with Lorraine Yates, a woman he met during one of his sales. They had 3 kids, John, Jonny, and Johane and when he died in 1950 he left his business to John. John John or “JJ” as he was called by family and friends took over his father's business with reluctance; he had no interest in going from door to door and was much more interested in computers and tech. With the rise of computers, he pivoted his father's business to what it is today a tech company. The company started with developing assistance tools for door-to-door car sales salesman businesses. The first products consisted of a hiring platform, a database, and a website for connecting the cars to the salesmen."
        ]
    },
    {
        "linkname": "Structure",
        "content": [
            "Skip ahead today, the company is run by the new CEO not John John anymore. He retired back in 2000, after 50 years in the company. The new leader is Loretta Smith. To better understand her work I have created a brief introduction to what it means to be a CEO.",
            "A chief executive officer (CEO),[1] chief administrator officer, or just chief executive (CE), is one of a number of corporate executives in charge of managing an organization – especially an independent legal entity such as a company or nonprofit institution. CEOs find roles in a range of organizations, including public and private corporations, non-profit organizations and even some government organizations (notably state-owned enterprises). The CEO of a corporation or company typically reports to the board of directors and is charged with maximizing the value of the business,[1] which may include maximizing the share price, market share, revenues or another element. In the non-profit and government sector, CEOs typically aim at achieving outcomes related to the organization's mission.",
            "Responsibilities: The responsibilities of an organization's CEO are set by the organization's board of directors or other authority, depending on the organization's structure. They can be far-reaching or quite limited and are typically enshrined in a formal delegation of authority regarding business administration. Typically, responsibilities include being a decision maker on business strategy and other key policy issues, leader, manager, and executor. The communicator role can involve speaking to the press and the rest of the outside world, as well as to the organization's management and employees; the decision-making role involves high-level decisions about policy and strategy.",
            "As an executive officer of the company, the CEO reports the status of the business to the board of directors, motivates employees, and drives change within the organization. As a manager, the CEO presides over the organization's day-to-day operations.[2][3][4] The CEO is the person who is ultimately accountable for a company's business decisions, including those in operations, marketing, business development, finance, human resources, etc.",
            "The CEO of a company is not necessarily the owner or the head of the company. The CEO of a political party is often entrusted with fundraising, particularly for election campaigns.",
            "International use: In some countries, there is a dual board system with two separate boards, one executive board for the day-to-day business and one supervisory board for control purposes (selected by the shareholders). In these countries, the CEO presides over the executive board and the chairman presides over the supervisory board, and these two roles will always be held by different people. This ensures a distinction between management by the executive board and governance by the supervisory board. This allows for clear lines of authority. The aim is to prevent a conflict of interest and too much power being concentrated in the hands of one person.",
            "In the United States, the board of directors (elected by the shareholders) is often equivalent to the supervisory board, while the executive board may often be known as the executive committee (the division/subsidiary heads and C-level officers that report directly to the CEO).",
            "In the United States, and in business, the executive officers are usually the top officers of a corporation, the chief executive officer (CEO) being the best-known type. The definition varies; for instance, the California Corporate Disclosure Act defines \"executive officers\" as the five most highly compensated officers not also sitting on the board of directors. In the case of a sole proprietorship, an executive officer is the sole proprietor. In the case of a partnership, an executive officer is a managing partner, senior partner, or administrative partner. In the case of a limited liability company, executive officer is any member, manager, or officer.",
            "Related positions:Depending on the organization, a CEO may have several subordinate executives to help run the day-to-day administration of the company, each of whom has specific functional responsibilities referred to as senior executives,[5] executive officers or corporate officers. Subordinate executives are given different titles in different organizations, but one common category of subordinate executive, if the CEO is also the president, is the vice-president (VP). An organization may have more than one vice-president, each tasked with a different area of responsibility (e.g., VP of finance, VP of human resources). Examples of subordinate executive officers who typically report to the CEO include the chief operating officer (COO), chief financial officer (CFO), chief strategy officer (CSO), and chief business officer (CBO). The public relations-focused position of chief reputation officer is sometimes included as one such subordinate executive officer, but, as suggested by Anthony Johndrow, CEO of Reputation Economy Advisors, it can also be seen as \"simply another way to add emphasis to the role of a modern-day CEO – where they are both the external face of, and the driving force behind, an organisation culture\".[6]",
            "United States: In the US, the term chief executive officer is used primarily in business, whereas the term executive director is used primarily in the not-for-profit sector. These terms are generally mutually exclusive and refer to distinct legal duties and responsibilities. Implicit in the use of these titles, is that the public not be misled and the general standard regarding their use be consistently applied.",
            "United Kingdom: In the UK, chief executive and chief executive officer are used in local government, business, and the charitable sector.[7] As of 2013, the use of the term director for senior charity staff is deprecated to avoid confusion with the legal duties and responsibilities associated with being a charity director or trustee, which are normally non-executive (unpaid) roles. In the United Kingdom, the term managing director is often used in lieu of chief executive officer.",
            "Celebrity CEO: Business publicists since the days of Edward Bernays (1891-1995) and his client John D. Rockefeller (1839-1937) and even more successfully the corporate publicists for Henry Ford, promoted the concept of the \"celebrity CEO\". Business journalists have often adopted this approach, which assumes that the corporate achievements, especially in the arena of manufacturing, are produced by unique talented individuals, especially the \"heroic CEO\". In effect, journalists celebrate a CEO who takes distinctive strategic actions. The model is the celebrity in entertainment, sports, and politics - compare \"Great man theory\". Guthey et al. argue that \"...these individuals are not self-made, but rather are created by a process of widespread media exposure to the point that their actions, personalities, and even private lives function symbolically to represent significant dynamics and tensions prevalent in the contemporary business atmosphere\".[8] Journalism thereby exaggerates the importance of the CEO and tends to neglect harder-to-describe broader corporate factors. There is little attention to the intricately organized technical bureaucracy that actually does the work. Hubris sets in when the CEO internalizes the celebrity and becomes excessively self-confident in making complex decisions. Indeed, there may be an emphasis on the sort of decisions that attract the celebrity journalists.[9]",
            "Research published in 2009 by Ulrike Malmendier and Geoffrey Tate indicates that \"firms with award-winning CEOs subsequently underperform, in terms both of stock and of operating performance\".[10]",
            "Executive compensation has been a source of criticism following a dramatic rise in pay relative to the average worker's wage. For example, the relative pay was 20-to-1 in 1965 in the US, but had risen to 376-to-1 by 2000.[11] The relative pay differs around the world, and, in some smaller countries, is still around 20-to-1.[12] Observers differ as to whether the rise is due to competition for talent or due to lack of control by compensation committees.[13] In recent years, investors have demanded more say over executive pay.[14]",
            "Lack of diversity amongst chief executives has also been a source of criticism.[15] In 2018, 5% of Fortune 500 CEOs were women.[16] The reasons for this are explained or justified in various ways, and may include biological sex differences, male and female differences in Big Five personality traits and temperament, sex differences in psychology and interests, maternity and career breaks, hypergamy, phallogocentrism, the existence of old boy networks, tradition, and the lack of female role models in that regard.[17][18][19] Some countries have passed laws mandating boardroom gender quotas.[20]",
            "Today, the business mainly operates in New Zealand and have moved their headquarters from the United States, and have no longer any business there. New Zealand must not be confused with Norway. Many consider these countries to be similar, however they are not. I have gone ahead and found some interesting facts about Norway and New Zealand, please look at the next url for these interesting facts."
        ]
    },
    {
        "linkname": "Trivia",
        "content": [
            "New Zealand (Māori: Aotearoa [aɔˈtɛaɾɔa]) is an island country in the southwestern Pacific Ocean. It consists of two main landmasses—the North Island (Te Ika-a-Māui) and the South Island (Te Waipounamu)—and over 700 smaller islands, covering a total area of 268,021 square kilometres (103,500 sq mi). New Zealand is about 2,000 kilometres (1,200 mi) east of Australia across the Tasman Sea and 1,000 kilometres (600 mi) south of the islands of New Caledonia, Fiji, and Tonga. The country's varied topography and sharp mountain peaks, including the Southern Alps, owe much to tectonic uplift and volcanic eruptions. New Zealand's capital city is Wellington, and its most populous city is Auckland. Owing to their remoteness, the islands of New Zealand were the last large habitable landmass to be settled by humans. Between about 1280 and 1350, Polynesians began to settle in the islands and then developed a distinctive Māori culture. In 1642, the Dutch explorer Abel Tasman became the first European to sight and record New Zealand. In 1840, representatives of the United Kingdom and Māori chiefs signed the Treaty of Waitangi, which declared British sovereignty over the islands. In 1841, New Zealand became a colony within the British Empire, and in 1907 it became a dominion; it gained full statutory independence in 1947, and the British monarch remained the head of state. Today, the majority of New Zealand's population of 5 million is of European descent; the indigenous Māori are the largest minority, followed by Asians and Pacific Islanders. Reflecting this, New Zealand's culture is mainly derived from Māori and early British settlers, with recent broadening of culture arising from increased immigration. The official languages are Māori and New Zealand Sign Language, with English being dominant and a de facto official language.[13]. A developed country, New Zealand ranks highly in international comparisons of national performance, such as quality of life, education, protection of civil liberties, government transparency, and economic freedom. New Zealand underwent major economic changes during the 1980s, which transformed it from a protectionist to a liberalised free-trade economy. The service sector dominates the national economy, followed by the industrial sector, and agriculture. International tourism is also a significant source of revenue. Nationally, legislative authority is vested in an elected, unicameral Parliament, while executive political power is exercised by the Cabinet, led by the prime minister, currently Jacinda Ardern. Queen Elizabeth II is the country's monarch and is represented by the governor-general. In addition, New Zealand is organised into 11 regional councils and 67 territorial authorities for local government purposes. The Realm of New Zealand also includes Tokelau (a dependent territory); the Cook Islands and Niue (self-governing states in free association with New Zealand); and the Ross Dependency, which is New Zealand's territorial claim in Antarctica. New Zealand is a member of the United Nations, Commonwealth of Nations, ANZUS, OECD, ASEAN Plus Six, Asia-Pacific Economic Cooperation, the Pacific Community and the Pacific Islands Forum.",
            "Some info about Norway: Norway, officially the Kingdom of Norway,[note 1] is a Nordic country in Northern Europe, the mainland territory of which comprises the western and northernmost portion of the Scandinavian Peninsula. The remote Arctic island of Jan Mayen and the archipelago of Svalbard also form part of Norway.[note 2] Bouvet Island, located in the Subantarctic, is a dependency of Norway; it also lays claims to the Antarctic territories of Peter I Island and Queen Maud Land. The capital and largest city in Norway is Oslo. Norway has a total area of 385,207 square kilometres (148,729 sq mi)[12] and had a population of 5,385,300 in November 2020.[21] The country shares a long eastern border with Sweden at a length of 1,619 km (1,006 mi). It is bordered by Finland and Russia to the north-east and the Skagerrak strait to the south, on the other side of which are Denmark and the United Kingdom. Norway has an extensive coastline, facing the North Atlantic Ocean and the Barents Sea. The maritime influence dominates Norway's climate, with mild lowland temperatures on the sea coasts; the interior, while colder, is also a lot milder than areas elsewhere in the world on such northerly latitudes. Even during polar night in the north, temperatures above freezing are commonplace on the coastline. The maritime influence brings high rainfall and snowfall to some areas of the country. Harald V of the House of Glücksburg is the current King of Norway. Jonas Gahr Støre has been prime minister since 2021, replacing Erna Solberg. As a unitary sovereign state with a constitutional monarchy, Norway divides state power between the parliament, the cabinet and the supreme court, as determined by the 1814 constitution. The kingdom was established in 872 as a merger of many petty kingdoms and has existed continuously for 1,150 years. From 1537 to 1814, Norway was a part of the Kingdom of Denmark–Norway, and from 1814 to 1905, it was in a personal union with the Kingdom of Sweden. Norway was neutral during the First World War and remained so until April 1940 when the country was invaded and occupied by Germany until the end of World War II. Norway has both administrative and political subdivisions on two levels: counties and municipalities. The Sámi people have a certain amount of self-determination and influence over traditional territories through the Sámi Parliament and the Finnmark Act. Norway maintains close ties with both the European Union and the United States. Norway is also a founding member of the United Nations, NATO, the European Free Trade Association, the Council of Europe, the Antarctic Treaty, and the Nordic Council; a member of the European Economic Area, the WTO, and the OECD; and a part of the Schengen Area. In addition, the Norwegian languages share mutual intelligibility with Danish and Swedish. Norway maintains the Nordic welfare model with universal health care and a comprehensive social security system, and its values are rooted in egalitarian ideals.[22] The Norwegian state has large ownership positions in key industrial sectors, having extensive reserves of petroleum, natural gas, minerals, lumber, seafood, and fresh water. The petroleum industry accounts for around a quarter of the country's gross domestic product (GDP).[23] On a per-capita basis, Norway is the world's largest producer of oil and natural gas outside of the Middle East.[24][25]. The country has the fourth-highest per-capita income in the world on the World Bank and IMF lists.[26] On the CIA's GDP (PPP) per capita list (2015 estimate) which includes autonomous territories and regions, Norway ranks as number eleven.[27] It has the world's largest sovereign wealth fund, with a value of US$1 trillion.[28] Norway has had the highest Human Development Index ranking in the world since 2009, a position also held previously between 2001 and 2006;[29] it also has the highest inequality-adjusted ranking per 2018.[30] Norway ranked first on the World Happiness Report for 2017[31] and currently ranks first on the OECD Better Life Index, the Index of Public Integrity, the Freedom Index,[32] and the Democracy Index.[33] Norway also has one of the lowest crime rates in the world.[34]. Although the majority of Norway's population is ethnic Norwegian, in the 21st century, immigration has accounted for more than half of population growth; as of 2021, the five largest minority groups in the country are the descendants of Polish, Lithuanian, Somali, Pakistani, and Swedish immigrants.[7]",
            "The company logo is an Electric eel, here is some interesting data about the animal. Electrophorus is a genus of Neotropical freshwater fish in the family Gymnotidae, commonly called electric eels. They are known for their ability to stun their prey by generating electricity. Despite their name, electric eels are not closely related to the true eels (Anguilliformes) but are members of the neotropical knifefish order (Gymnotiformes), which is more closely related to the catfish.",
            "It was believed to be a monotypic genus for over two centuries, until the unexpected 2019 discovery of two additional species.",
            "The genus is so unusual that it has been reclassified several times. When the species now defined as Electrophorus electricus was originally described by Carl Linnaeus in 1766, he used the name Gymnotus electricus, placing it in the same genus as Gymnotus carapo (banded knifefish) which he had described several years earlier. It was only about a century later, in 1864, that electric eels were moved to their own genus Electrophorus by Theodore Gill.[3]",
            "Later, electric eels were considered sufficiently distinct to have their own family, Electrophoridae, but they have since been merged back into the family Gymnotidae, alongside Gymnotus.[4][5][6]",
            "In September 2019, C. David de Santana et al. published work strongly suggesting division of Electrophorus electricus into three species based on DNA divergence, ecology and habitat, anatomy and physiology, and electrical ability. The proposed three species are E. electricus, E. voltai sp. nov., and E. varii sp. nov.[7]",
            "Electric eels are air-breathers.[8]",
            "Electric eels have three pairs of abdominal organs that produce electricity: the main organ, Hunter's organ, and Sachs' organ. These organs make up four fifths of their body, and give electric eel's the ability to generate two types of electric organ discharges: low voltage and high voltage. These organs are made of electrocytes, lined up so a current of ions can flow through them and stacked so each one adds to a potential difference.[9]",
            "When eels identify prey, their brain sends a signal through the nervous system to the electrocytes. This opens the ion channels, allowing sodium to flow through, reversing the polarity momentarily. By causing a sudden difference in electric potential, it generates an electric current in a manner similar to a battery, in which stacked plates each produce an electric potential difference.[9] Electric eels are also capable of controlling their prey's nervous systems with their electrical abilities; by controlling their victim's nervous system and muscles via electrical pulses, they can keep prey from escaping or force it to move so they can locate its position.[10][11]"
        ]
    },
    {
        "linkname": "Random",
        "content": [
            "In the pre-modern world, the term border was vague and could refer to either side of the boundary, thus it was necessary to specify part of it with borderline or borderland. During the medieval period the government's control frequently diminished the further people got from the capital, therefore borderland (especially impassable terrain) attracted many outlaws, as they often found sympathizers.[2] In the past, many borders were not clearly defined lines; instead there were often intervening areas often claimed and fought over by both sides, sometimes called marchlands. Special cases in modern times were the SaudiArabian Iraqi neutral zone from 1922 to 1991 and the Saudi Arabian Kuwaiti neutral zone from 1922 until 1970. In modern times, marchlands have been replaced by clearly defined and demarcated borders. For the purposes of border control, airports and seaports are also classed as borders. Most countries have some form of border control to regulate or limit the movement of people, animals, and goods into and out of the country. Under international law, each country is generally permitted to legislate the conditions that have to be met in order to cross its borders, and to prevent people from crossing its borders in violation of those laws. Some borders require presentation of legal paperwork like passports and visas, or other identity documents, for persons to cross borders. To stay or work within a country's borders aliens (foreign persons) may need special immigration documents or permits; but possession of such documents does not guarantee that the person should be allowed to cross the border.Moving goods across a border often requires the payment of excise tax, often collected by customs officials. Animals (and occasionally humans) moving across borders may need to go into quarantine to prevent the spread of exotic infectious diseases. Most countries prohibit carrying illegal drugs or endangered animals across their borders. Moving goods, animals, or people illegally across a border, without declaring them or seeking permission, or deliberately evading official inspection, constitutes smuggling. Controls on car liability insurance validity and other formalities may also take place. In places where smuggling, migration, and infiltration are a problem, many countries fortify borders with fences and barriers, and institute formal border control procedures. These can extend inland, as in the United States where the U.S. Customs and Border Protection service has jurisdiction to operate up to 100 miles from any land or sea boundary.[3] On the other hand, some borders are merely signposted. This is common in countries within the European Schengen Area and on rural sections of the CanadaUnited States border. Borders may even be completely unmarked, typically in remote or forested regions; such borders are often described as \"porous\". Migration within territorial borders, and outside of them, represented an old and established pattern of movement in African countries, in seeking work and food, and to maintain ties with kin who had moved across the previously porous borders of their homelands. When the colonial frontiers were drawn, Western countries attempted to obtain a monopoly on the recruitment of labor in many African countries, which altered the practical and institutional context in which the old migration patterns had been followed, and some might argue, are still followed today. \nThe frontiers were particularly porous for the physical movement of migrants, and people living in borderlands easily maintained transnational cultural and social networks.A border may have been: Agreed by the countries on both sides Imposed by the country on one side Imposed by third parties, e.g. an international conference Inherited from a former state, colonial power or aristocratic territory Inherited from a former internal border, such as within the former Soviet Union Never formally defined. In addition, a border may be a de facto military ceasefire line.",
            "\nThere is wide agreement that philosophy (from the ancient Greek φίλος, phílos: \"love\"; and σοφία, sophía: \"wisdom\")[20] is characterized by various general features: it is a form of rational inquiry, it aims to be systematic, and it tends to critically reflect on its own methods and presuppositions.[21][22][23] But approaches that go beyond such vague characterizations to give a more interesting or profound definition are usually controversial.[22][23] Often, they are only accepted by theorists belonging to a certain philosophical movement and are revisionistic in that many presumed parts of philosophy would not deserve the title \"philosophy\" if they were true.[24][25] Before the modern age, the term was used in a very wide sense, which included the individual sciences, like physics or mathematics, as its sub-disciplines, but the contemporary usage is more narrow.[23][26][27]. Some approaches argue that there is a set of essential features shared by all parts of philosophy while others see only weaker family resemblances or contend that it is merely an empty blanket term.[28][25][29] Some definitions characterize philosophy in relation to its method, like pure reasoning. Others focus more on its topic, for example, as the study of the biggest patterns of the world as a whole or as the attempt to answer the big questions.[25][30][31] Both approaches have the problem that they are usually either too wide, by including non-philosophical disciplines, or too narrow, by excluding some philosophical sub-disciplines.[25] Many definitions of philosophy emphasize its intimate relation to science.[23] In this sense, philosophy is sometimes understood as a proper science in its own right. Some naturalist approaches, for example, see philosophy as an empirical yet very abstract science that is concerned with very wide-ranging empirical patterns instead of particular observations.[25][32] Some phenomenologists, on the other hand, characterize philosophy as the science of essences.[24][33][34] Science-based definitions usually face the problem of explaining why philosophy in its long history has not made the type of progress as seen in other sciences.[25][35][36] This problem is avoided by seeing philosophy as an immature or provisional science whose subdisciplines cease to be philosophy once they have fully developed.[23][28][33] In this sense, philosophy is the midwife of the sciences.[23]. Other definitions focus more on the contrast between science and philosophy. ",
            "\nA common theme among many such definitions is that philosophy is concerned with meaning, understanding, or the clarification of language.[30][25] According to one view, philosophy is conceptual analysis, which involves finding the necessary and sufficient conditions for the application of concepts.[31][25][37] Another defines philosophy as a linguistic therapy that aims at dispelling misunderstandings to which humans are susceptible due to the confusing structure of natural language.[24][23][38] One more approach holds that the main task of philosophy is to articulate the pre-ontological understanding of the world, which acts as a condition of possibility of experience.[25][39][40]. Many other definitions of philosophy do not clearly fall into any of the aforementioned categories. An early approach already found in ancient Greek and Roman philosophy is that philosophy is the spiritual practice of developing one's reasoning ability.[41][42] This practice is an expression of the philosopher's love of wisdom and has the aim of improving one's well-being by leading a reflective life.[43] A closely related approach identifies the development and articulation of worldviews as the principal task of philosophy, i.e. to express how things on the grand scale hang together and which practical stance we should take towards them.[25][21][44] Another definition characterizes philosophy as thinking about thinking in order to emphasize its reflective nature.[25][31]"
        ]
    }
]